nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt685/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACC_INT_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_INT_GPIO_PIN_MASK (1U << 5U)          /*!<@brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACC_INT_PORT 1U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_INT_PIN 5U                            /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACC_INT_PIN_MASK (1U << 5U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO1_7 (coord J15), J28[2]/J45[36]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_ACC_RESET_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_ACC_RESET_SIGNAL PIO1
/*!
 * @brief Signal channel */
#define BOARD_INITACCELPINS_ACC_RESET_CHANNEL 7

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_RESET_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACC_RESET_GPIO_PIN_MASK (1U << 7U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACC_RESET_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_ACC_RESET_PIN 7U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_ACC_RESET_PIN_MASK (1U << 7U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
